{
    "documentation": {
      "start_url": {
        "description": "URL del sitio web a scrapear. Debe ser una URL válida."
      },
      "actions": {
        "description": "Lista de acciones a realizar en el sitio web, ordenadas secuencialmente.",
        "action": {
          "description": "Tipo de acción a ejecutar. Los valores posibles son: 'click', 'input', 'key_press', 'wait', 'get_element_text', 'find_elements', 'store_data', 'go_back', 'scroll'."
        },
        "by": {
          "description": "Método para ubicar el elemento. Los valores posibles son: 'CSS_SELECTOR', 'ID', 'NAME', 'XPATH', 'LINK_TEXT', 'PARTIAL_LINK_TEXT', 'TAG_NAME', 'CLASS_NAME'."
        },
        "value": {
          "description": "Selector específico del elemento en la página web. Debe ser un selector válido según el método especificado en 'by'."
        },
        "input_value": {
          "description": "Texto a ingresar en un campo de entrada (para 'input')."
        },
        "key": {
          "description": "Tecla a presionar en un elemento (para 'key_press'). Debe ser una tecla válida de Selenium Keys."
        },
        "hidden": {
          "description": "Indica si el campo de entrada está oculto. Es un valor booleano (para 'input')."
        },
        "wait": {
          "description": "Tiempo en segundos para esperar entre acciones. Puede ser un número entero o decimal."
        },
        "columns": {
          "description": "Definición de columnas para la acción 'find_elements'.",
          "action": {
            "description": "Tipo de acción a realizar dentro de 'columns'. Los valores posibles son: 'get_element_text', 'store_data'."
          },
          "by": {
            "description": "Método para ubicar el elemento dentro de 'columns'. El valor posible es 'CSS_SELECTOR'."
          },
          "value": {
            "description": "Selector específico del elemento dentro de 'columns'. Debe ser un selector válido."
          },
          "save_as": {
            "description": "Nombre de la clave en la que se almacenará el texto obtenido. Se usa para almacenar datos en el formato especificado."
          },
          "data": {
            "description": "Datos a almacenar en 'store_data'. Puede incluir variables que se formatean con los datos del elemento."
          }
        },
        "repeat": {
          "description": "Número de veces que se repetirá una acción. Es un número entero positivo."
        }
      },
      "output": {
        "description": "Detalles sobre el archivo de salida donde se guardarán los datos obtenidos.",
        "filename": {
          "description": "Nombre del archivo Excel donde se almacenarán los datos. Debe incluir la extensión '.xlsx'."
        },
        "columns": {
          "description": "Lista de nombres de columnas que se incluirán en el archivo de salida. Debe coincidir con los nombres de las columnas en los datos."
        }
      }
    }
  }
  